from random import choice, randint
import time


def get_name(length=2, x=''):
    """获取随机姓名，length>1有效,默认长度为2, x参数指定姓"""
    xing = [
        '赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许',
        '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章',
        '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳',
        '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常',
        '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹',
        '姚', '邵', '堪', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
        '欧阳', '太史', '端木', '上官', '司马', '东方', '独孤', '南宫', '万俟', '闻人', '夏侯', '诸葛', '尉迟', '公羊', '赫连',
        '澹台', '皇甫', '宗政', '濮阳', '公冶', '太叔', '申屠', '公孙', '慕容', '仲孙', '钟离', '长孙', '宇文', '司徒', '鲜于',
        '司空', '闾丘', '子车', '亓官', '司寇', '巫马', '公西', '颛孙', '壤驷', '公良', '漆雕', '乐正', '宰父', '谷梁', '拓跋',
        '夹谷', '轩辕', '令狐', '段干', '百里', '呼延', '东郭', '南门', '羊舌', '微生', '公户', '公玉', '公仪', '梁丘', '公仲',
        '公上', '公门', '公山', '公坚', '左丘', '公伯', '西门', '公祖', '第五', '公乘', '贯丘', '公皙', '南荣', '东里', '东宫',
        '仲长', '子书', '子桑', '即墨', '淳于', '达奚', '褚师', '吴铭', '纳兰', '归海']
    ming = ['佳', '雪', '韵', '晓', '涛', '星', '楠', '侠', '采', '运', '芙', '柏', '春', '杰', '奇', '彦', '郁', '鹤', '莉',
            '弘', '桃', '倩', '娅', '沛', '暄', '喆', '翰', '琪', '平', '铭', '欣', '华', '中', '梦', '帝', '起', '海', '瑞',
            '韦', '峰', '萱', '静', '安', '妍', '呈', '宇', '雅', '玲', '珊', '克', '澄', '玥', '芝', '心', '雨', '珍', '杉',
            '濡', '丽', '琬', '璟', '璇', '泽', '霞', '俊', '柔', '哲', '杞', '蕾', '荣', '娜', '彤', '远', '恒', '龙', '弦',
            '彩', '勇', '寒', '阳', '茹', '吉', '辰', '畅', '碧', '芸', '轩', '骏', '逸', '天', '琳', '曦', '菡', '露', '媛',
            '钰', '佑', '辞', '雯', '帛', '桂', '欢', '歆', '美', '凡', '凯', '诚', '禧', '茜', '成', '晨', '芳', '诗', '然',
            '强', '栀', '仕', '博', '馨', '鸿', '婧', '颖', '延', '锋', '斌', '盛', '明', '灵', '梁', '邦', '梓', '槐', '梅',
            '冰', '贤', '信', '桐', '淑', '加', '香', '珠', '康', '慧', '枫', '优', '晖', '敏', '材', '菲', '锦', '鹏', '嘉',
            '家', '凌', '栋', '福', '乘', '桓', '岚', '曼', '卓', '礼', '婷', '尧', '寅', '翱', '谷', '祯', '权', '玉', '锟',
            '林', '帆', '浩', '颜', '涵', '伟', '鑫', '祜', '蓓', '花', '年', '璐', '蔚', '洲', '格', '漫', '彬', '依', '月',
            '腾', '薇']
    m = ''
    if not x:
        x = choice(xing)
    if length - len(x) > 0:
        for i in range(length - len(x)):
            m += choice(ming)
    return x + m


def get_sex():
    """性别"""
    sex_list = ['男', '女']
    return choice(sex_list)


def get_birthday(fmt='%Y%m%d'):
    """出生年月日"""
    start_time = 0  # 1970-01-01
    end_time = 946656001  # 2000-01-01
    random_time = randint(start_time, end_time)
    birthday = time.localtime(random_time)
    return time.strftime(fmt, birthday)


def get_id_type():
    """证件类型"""
    types = ['身份证', '护照']
    return choice(types)


def get_id_number():
    """证件号码，长度为18"""
    nums = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
    id_number = ''
    for i in range(18):
        id_number += choice(nums)
    return id_number


def get_member_characteristic():
    """人员特征"""
    characteristics = ['普通人员', '知名人员', '残疾人员', '独居老人', '重点治疗人员', '安置帮教人员', '重点关注人员',
                       '其他关注人员', '在逃人员']
    return choice(characteristics)


def get_member_type():
    """人员类型"""
    types = ['住户人员', '租户人员', '亲情人员', '住户服务', '访客人员', '快递人员', '外卖人员', '小区保安人员',
             '小区物业人员', '小区工作人员', '小区服务人员']
    return choice(types)


def get_ethnicity():
    """民族"""
    ethnicity = ["汉族", "蒙古族", "回族", "藏族", "维吾尔族", "苗族", "彝族", "壮族", "布依族", "朝鲜族", "满族", "侗族",
                 "瑶族", "白族", "土家族", "哈尼族", "哈萨克族", "傣族", "黎族", "傈僳族", "佤族", "畲族", "高山族", "拉祜族",
                 "水族", "东乡族", "纳西族", "景颇族", "柯尔克孜族", "土族", "达斡尔族", "仫佬族", "羌族", "布朗族", "撒拉族",
                 "毛南族", "仡佬族", "锡伯族", "阿昌族", "普米族", "塔吉克族", "怒族", "乌孜别克族", "俄罗斯族", "鄂温克族",
                 "德昂族", "保安族", "裕固族", "京族", "塔塔尔族", "独龙族", "鄂伦春族", "赫哲族", "门巴族", "珞巴族", "基诺族"]
    return choice(ethnicity)


def get_serial_number():
    """编号，返回时间戳小数点后七位"""
    number = str(time.time()).split('.')[1]
    prefix = 'No'
    return prefix + number


def get_address(province_flag=True, city_flag=True, street_flag=True, street_num_flag=True, length=0):
    """住址，length用于扩展长度"""
    province = ['北京市', '天津市', '上海市', '重庆市', '河北省', '山西省', '辽宁省', '吉林省', '黑龙江省', '江苏省',
                '浙江省', '安徽省', '福建省', '江西省', '山东省', '河南省', '湖北省', '湖南省', '广东省', '海南省',
                '四川省', '贵州省', '云南省', '陕西省', '甘肃省', '青海省', '台湾省', '内蒙古自治区', '广西壮族自治区',
                '西藏自治区', '宁夏回族自治区', '新疆维吾尔自治区', '香港特别行政区', '澳门特别行政区']
    city = ['上海', '北京', '广州', '深圳', '天津', '南京', '重庆', '成都', '武汉', '杭州', '青岛', '苏州', '西安', '沈阳',
            '郑州', '宁波', '长沙', '无锡', '大连', '济南', '合肥', '厦门', '佛山', '福州', '东莞', '哈尔滨', '长春',
            '石家庄', '昆明', '南昌', '南宁', '温州', '乌鲁木齐', '常州', '太原', '徐州', '贵阳', '烟台', '泉州', '唐山',
            '南通', '潍坊', '兰州', '扬州', '呼和浩特', '洛阳', '桂林', '拉萨', '海口', '惠州', '淄博', '临沂', '泰州',
            '绍兴', '东营', '中山', '珠海', '舟山', '三亚']
    street = ['重庆大厦', '黑龙江路', '十梅庵街', '遵义路', '湘潭街', '瑞金广场', '仙山街', '仙山东路', '仙山西大厦',
              '白沙河路', '赵红广场', '机场路', '民航街', '长城南路', '流亭立交桥', '虹桥广场', '长城大厦', '礼阳路',
              '风岗街', '中川路', '白塔广场', '兴阳路', '文阳街', '绣城路', '河城大厦', '锦城广场', '崇阳街', '华城路',
              '康城街', '正阳路', '和阳广场', '中城路', '江城大厦', '顺城路', '安城街', '山城广场', '春城街', '国城路',
              '泰城街', '德阳路', '明阳大厦', '春阳路', '艳阳街', '秋阳路', '硕阳街', '青威高速', '瑞阳街', '丰海路',
              '双元大厦', '惜福镇街道', '夏庄街道', '古庙工业园', '中山街', '太平路', '广西街', '潍县广场', '博山大厦',
              '湖南路', '济宁街', '芝罘路', '易州广场', '荷泽四路', '荷泽二街', '荷泽一路', '荷泽三大厦', '观海二广场',
              '广西支街', '观海一路', '济宁支街', '莒县路', '平度广场', '明水路', '蒙阴大厦', '青岛路', '湖北街',
              '江宁广场', '郯城街', '天津路', '保定街', '安徽路', '河北大厦', '黄岛路', '北京街', '莘县路', '济南街',
              '宁阳广场', '日照街', '德县路', '新泰大厦', '荷泽路', '山西广场', '沂水路', '肥城街', '兰山路', '四方街',
              '平原广场', '泗水大厦', '浙江路', '曲阜街', '寿康路', '河南广场', '泰安路', '大沽街', '红山峡支路',
              '西陵峡一大厦', '台西纬一广场', '台西纬四街', '台西纬二路', '西陵峡二街', '西陵峡三路', '台西纬三广场',
              '台西纬五路', '明月峡大厦', '青铜峡路', '台西二街', '观音峡广场', '瞿塘峡街', '团岛二路', '团岛一街',
              '台西三路', '台西一大厦', '郓城南路', '团岛三街', '刘家峡路', '西藏二街', '西藏一广场', '台西四街', '三门峡路']
    address = ''
    if province_flag:
        address += choice(province)
    if city_flag:
        address += choice(city)
    if street_flag:
        address += choice(street)
    if street_num_flag:
        address += str(randint(10000, 99999)) + '号'
    if length > 0:
        if len(address) < length:
            address += '占' * (length - len(address) - 1)
            address += '停'
    return address


def get_remark():
    """备注"""
    remark = ['昔人已乘黄鹤去，此地空余黄鹤楼', '黄鹤一去不复返，白云千载空悠悠', '晴川历历汉阳树，芳草萋萋鹦鹉洲',
              '日暮乡关何处是，烟波江上使人愁', '风急天高猿啸哀，渚清沙白鸟飞回', '无边落木萧萧下，不尽长江滚滚来',
              '万里悲秋常作客，百年多病独登台', '艰难苦恨繁霜鬓，潦倒新停浊酒杯', '玉露凋伤枫树林，巫山巫峡气萧森',
              '江间波浪兼天涌，塞上风云接地阴', '丛菊两开他日泪，孤舟一系故园心', '寒衣处处催刀尺，白帝城高急暮砧',
              '夔府孤城落日斜，每依北斗望京华', '听猿实下三声泪，奉使虚随八月槎', '画省香炉违伏枕，山楼粉堞隐悲笳',
              '请看石上藤萝月，已映洲前芦荻花', '千家山郭静朝晖，日日江楼坐翠微', '信宿渔人还泛泛，清秋燕子故飞飞',
              '匡衡抗疏功名薄，刘向传经心事违', '同学少年多不贱，五陵裘马自轻肥', '锦瑟无端五十弦，一弦一柱思华年',
              '庄生晓梦迷蝴蝶，望帝春心托杜鹃', '沧海月明珠有泪，蓝田日暖玉生烟', '此情可待成追忆，只是当时已惘然',
              '丞相祠堂何处寻，锦官城外柏森森', '映阶碧草自春色，隔叶黄鹂空好音', '三顾频烦天下计，两朝开济老臣心',
              '出师未捷身先死，长使英雄泪满襟', '相见时难别亦难，东风无力百花残', '春蚕到死丝方尽，蜡炬成灰泪始干',
              '晓镜但愁云鬓改，夜吟应觉月光寒', '蓬山此去无多路，青鸟殷勤为探看', '剑外忽传收蓟北，初闻涕泪满衣裳',
              '却看妻子愁何在，漫卷诗书喜欲狂', '白日放歌须纵酒，青春作伴好还乡', '即从巴峡穿巫峡，便下襄阳向洛阳',
              '澹然空水对斜晖。曲岛苍茫接翠微', '波上马嘶看棹去，柳边人歇待船归', '数丛沙草群鸥散，万顷江田一鹭飞',
              '谁解乘舟寻范蠡，五湖烟水独忘机']
    return choice(remark)


if __name__ == '__main__':
    print(get_name())
    print(get_birthday())
    print(get_sex())
    print(get_ethnicity())
    print(get_serial_number())
    print(get_address())
    print(get_remark())
